x1 = int(input("Введите координату первой точки: "))
y1 = int(input("Введите координату второй точки: "))
x2 = int(input("Введите координату третьей точки: "))
y2 = int(input("Введите координату четвёртой точки: "))
x3 = int(input("Введите координату пятой точки: "))
y3 = int(input("Введите координату шестой точки: "))
a = (((x2 - x1) ** 2) + (y2 - y1) ** 2) ** 0.5
b = (((x3 - x2) ** 2) + (y3 - y2) ** 2) ** 0.5
c = (((x3 - x1) ** 2) + (y3 - y1) ** 2) ** 0.5
P = (a + b + c)
p = (a + b + c) / 2
S = (p * (p - a) * (p - b) * (p - c)) ** 0.5
print(f"Площаль треугольника равна: {S}, периметр равен: {P}")